<details ><summary>apply for portal 2024-12-26 17:01:43 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd_workers[0] will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_workers" {
        id    = "560394105"
        name  = "worker-1.portal-renterd-cluster.node.testing"
      ~ value = "q7j97ljvp5fnn9vph0gg6hmho8.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19523999:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creation complete after 18s [id=19524472:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_workers[0]: Modifying... [id=560394105]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Modifying... [id=19523999:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_workers[0]: Modifications complete after 1s [id=560394105]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Modifications complete after 7s [id=19523999:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 1 added, 2 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:32015"
renterd_autopilot_endpoint = "autopilot.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_bus_endpoint = "bus.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_workers_endpoints = [
  "worker-1.portal-renterd-cluster.node.testing.pinner.xyz",
]

```
</details>
</details>